#  В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.

# 4 -> 1 2 3 4
# 9

n = int(input('vvedite kolichestvo kustov: '))
kusti = list()

for i in range(n):
    num = i + 1
    m = int(input('vvedite kolichestvo yagot na kuste ' + str(num) +': '))
    kusti.append(m)

print(kusti)

max = 0

for i in range(n):
    current = kusti[i]
    prev = kusti[i-1]

    if (i == n - 1):
        next = kusti[0]
    else:
        next = kusti[i+1]

    cnt = prev + current + next
    if(cnt > max):
        max = cnt

print(max)